Magicoe/LPC_LiteOS/platform/LPC5410x_Xpresso/chip_driver/fsl_clock.c
    for (i = 0U; (i <= 2U) && (!final_descriptor); i++)
    {
        connection = (clock_attach_id_t)(connection >> (i * 12U)); /* pick up next descriptor */
        mux = (uint8_t)connection;
        if (connection)
        {
            pos = ((connection & 0xf00U) >> 8U) - 1U;
            if (mux == CM_ASYNCAPA)
            {
                SYSCON->ASYNCAPBCTRL = SYSCON_ASYNCAPBCTRL_ENABLE_MASK;
                ASYNC_SYSCON->ASYNCAPBCLKSELA = pos;
            }
            else if (mux == CM_ASYNCAPB)
            {
                pos = ((connection & 0xf00U) >> 8U) - 1U;
                ASYNC_SYSCON->ASYNCAPBCLKSELB = pos;
                final_descriptor = true;
            }
            else
            {
                pClkSel[mux] = pos;
            }
        }
        else
        {
            final_descriptor = true;
        }
    }
}

void CLOCK_SetClkDiv(clock_div_name_t div_name, uint32_t divided_by_value, bool reset)
{
    /* param reset is not used, to align with other LPC series*/
    volatile uint32_t *pClkDiv;
    pClkDiv = &(SYSCON->SYSTICKCLKDIV);
    /* if divided_by_value is 0, clock will be disable */
    pClkDiv[div_name] = divided_by_value;
}

uint32_t CLOCK_GetExtClkFreq(void)
{
    return g_Ext_Freq;
}

uint32_t CLOCK_GetWdtOscFreq(void)
{
    if (SYSCON->PDRUNCFG & (1UL << (kPDRUNCFG_PD_WDT_OSC & 0xffU)))
    {
        return 0U;
    }
    else
    {
        return 500000U;
    }
}

uint32_t CLOCK_GetPllOutFreq(void)
{
    return s_Pll_Freq;
}

uint32_t CLOCK_GetOsc32KFreq(void)
{
    if (SYSCON->RTCOSCCTRL & SYSCON_RTCOSCCTRL_EN_MASK)
    {
        return CLK_RTC_32K_CLK;
    }
    else
    {
        return 0U;
    }
}

/* Get ADC Clk */
uint32_t CLOCK_GetAdcClkFreq(void)
{
    uint32_t freq;
    if ((SYSCON->ADCCLKDIV & SYSCON_ADCCLKDIV_DIV_MASK) == 0U)
    {
        return 0U;
    }
    else
    {
        freq = ((SYSCON->ADCCLKSEL & SYSCON_ADCCLKSEL_SEL_MASK) == 0U) ?
                   CLOCK_GetMainClkFreq() :
                   ((SYSCON->ADCCLKSEL & SYSCON_ADCCLKSEL_SEL_MASK) == 1U) ?
                   CLOCK_GetPllOutFreq() :
                   ((SYSCON->ADCCLKSEL & SYSCON_ADCCLKSEL_SEL_MASK) == 2U) ? CLOCK_GetIrc12MFreq() : 0U;
        freq = freq / (SYSCON->ADCCLKDIV & SYSCON_ADCCLKDIV_DIV_MASK);
        return freq;
    }
}

/* Get CLOCK OUT Clk */
uint32_t CLOCK_GetClockOutClkFreq(void)
{
    uint32_t freq;
    if ((SYSCON->CLKOUTDIV & SYSCON_CLKOUTDIV_DIV_MASK) == 0U)
    {
        return 0U;
    }
    else
    {
        freq = (((SYSCON->CLKOUTSELB & SYSCON_CLKOUTSELB_SEL_MASK) == 0U) &&
                ((SYSCON->CLKOUTSELA & SYSCON_CLKOUTSELA_SEL_MASK) == 0U)) ?
                   CLOCK_GetMainClkFreq() :
                   (((SYSCON->CLKOUTSELB & SYSCON_CLKOUTSELB_SEL_MASK) == 0U) &&
                    ((SYSCON->CLKOUTSELA & SYSCON_CLKOUTSELA_SEL_MASK) == 1U)) ?
                   CLOCK_GetExtClkFreq() :
                   (((SYSCON->CLKOUTSELB & SYSCON_CLKOUTSELB_SEL_MASK) == 0U) &&
                    ((SYSCON->CLKOUTSELA & SYSCON_CLKOUTSELA_SEL_MASK) == 2U)) ?
                   CLOCK_GetWdtOscFreq() :
                   (((SYSCON->CLKOUTSELB & SYSCON_CLKOUTSELB_SEL_MASK) == 0U) &&
                    ((SYSCON->CLKOUTSELA & SYSCON_CLKOUTSELA_SEL_MASK) == 3U)) ?
                   CLOCK_GetIrc12MFreq() :
                   ((SYSCON->CLKOUTSELB & SYSCON_CLKOUTSELB_SEL_MASK) == 3U) ? CLOCK_GetOsc32KFreq() : 0U;
        freq = freq / (SYSCON->CLKOUTDIV & SYSCON_CLKOUTDIV_DIV_MASK);

        return freq;
    }
}

uint32_t CLOCK_GetIrc12MFreq(void)
{
    if ((!(SYSCON->PDRUNCFG & SYSCON_PDRUNCFG_PDEN_IRC_OSC_MASK)) &&
        (!(SYSCON->PDRUNCFG & SYSCON_PDRUNCFG_PDEN_IRC_MASK)))
    {
        return 12000000U;
    }
    else
    {
        return 0U;
    }
}

uint32_t CLOCK_GetPllInFreq(void)
{
    uint32_t freq;
    uint32_t sel = (uint32_t)(SYSCON->SYSPLLCLKSEL & SYSCON_SYSPLLCLKSEL_SEL_MASK);
    switch (sel)
    {
        case 0U:
            freq = CLOCK_GetIrc12MFreq();
            break;
        case 1U:
            freq = CLOCK_GetExtClkFreq();
            break;
        case 3U:
            freq = CLOCK_GetOsc32KFreq();
            break;
        default:
            freq = 0U;
            break;
    }
    return freq;
}

uint32_t CLOCK_GetMainClkFreq(void)
{
    return ((((SYSCON->MAINCLKSELB & SYSCON_MAINCLKSELB_SEL_MASK) == 0U) &&
             ((SYSCON->MAINCLKSELA & SYSCON_MAINCLKSELA_SEL_MASK) == 0U)) ?
                CLOCK_GetIrc12MFreq() :
                (((SYSCON->MAINCLKSELB & SYSCON_MAINCLKSELB_SEL_MASK) == 0U) &&
                 ((SYSCON->MAINCLKSELA & SYSCON_MAINCLKSELA_SEL_MASK) == 1U)) ?
                CLOCK_GetExtClkFreq() :
                (((SYSCON->MAINCLKSELB & SYSCON_MAINCLKSELB_SEL_MASK) == 0U) &&
                 ((SYSCON->MAINCLKSELA & SYSCON_MAINCLKSELA_SEL_MASK) == 2U)) ?
                CLOCK_GetWdtOscFreq() :
                ((SYSCON->MAINCLKSELB & SYSCON_MAINCLKSELB_SEL_MASK) == 1U) ?
                CLOCK_GetPllInFreq() :
                ((SYSCON->MAINCLKSELB & SYSCON_MAINCLKSELB_SEL_MASK) == 2U) ?
                CLOCK_GetPllOutFreq() :
                ((SYSCON->MAINCLKSELB & SYSCON_MAINCLKSELB_SEL_MASK) == 3U) ? CLOCK_GetOsc32KFreq() : 0U);
}

uint32_t CLOCK_GetAsyncApbClkFreq(void)
{
    if ((ASYNC_SYSCON->ASYNCCLKDIV & ASYNC_SYSCON_FRGCTRL_DIV_MASK) == 0U)
    {
        return 0U;
    }
    else
    {
        return (((((ASYNC_SYSCON->ASYNCAPBCLKSELB & ASYNC_SYSCON_ASYNCAPBCLKSELB_SEL_MASK) == 3U) &&
                  ((ASYNC_SYSCON->ASYNCAPBCLKSELA & ASYNC_SYSCON_ASYNCAPBCLKSELA_SEL_MASK) == 0U)) ?
                     CLOCK_GetIrc12MFreq() :
                     (((ASYNC_SYSCON->ASYNCAPBCLKSELB & ASYNC_SYSCON_ASYNCAPBCLKSELB_SEL_MASK) == 3U) &&
                      ((ASYNC_SYSCON->ASYNCAPBCLKSELA & ASYNC_SYSCON_ASYNCAPBCLKSELA_SEL_MASK) == 1U)) ?
                     CLOCK_GetWdtOscFreq() :
                     ((ASYNC_SYSCON->ASYNCAPBCLKSELB & ASYNC_SYSCON_ASYNCAPBCLKSELB_SEL_MASK) == 0U) ?
                     CLOCK_GetMainClkFreq() :
                     ((ASYNC_SYSCON->ASYNCAPBCLKSELB & ASYNC_SYSCON_ASYNCAPBCLKSELB_SEL_MASK) == 1U) ?
                     CLOCK_GetExtClkFreq() :
                     ((ASYNC_SYSCON->ASYNCAPBCLKSELB & ASYNC_SYSCON_ASYNCAPBCLKSELB_SEL_MASK) == 2U) ?
                     CLOCK_GetPllOutFreq() :
                     0U)) /
               (ASYNC_SYSCON->ASYNCCLKDIV);
    }
}

bool CLOCK_SetFRGClock(uint32_t freq)
{
    uint32_t input = CLOCK_GetAsyncApbClkFreq();
    uint32_t mul;
    assert(freq);
    if (freq > input)
    {
        return false;
    }
    else
    {
        mul = (uint32_t)(((uint64_t)(input - freq) * 256) / ((uint64_t)freq));
        ASYNC_SYSCON->FRGCTRL = (mul << ASYNC_SYSCON_FRGCTRL_MULT_SHIFT) | ASYNC_SYSCON_FRGCTRL_DIV_MASK;
        return true;
    }
}

uint32_t CLOCK_GetCoreClkFreq(void)
{
    if ((SYSCON->AHBCLKDIV & SYSCON_AHBCLKDIV_DIV_MASK) == 0U)
    {
        return 0U;
    }
    else
    {
        return (CLOCK_GetMainClkFreq() / (SYSCON->AHBCLKDIV & SYSCON_AHBCLKDIV_DIV_MASK));
    }
}

uint32_t CLOCK_GetBusClFreq(void)
{
    if ((SYSCON->AHBCLKDIV & SYSCON_AHBCLKDIV_DIV_MASK) == 0U)
    {
        return 0U;
    }
    else
    {
        return (CLOCK_GetMainClkFreq() / (SYSCON->AHBCLKDIV & SYSCON_AHBCLKDIV_DIV_MASK));
    }
}

uint32_t CLOCK_GetUsartClkFreq(void)
{
    if ((ASYNC_SYSCON->ASYNCCLKDIV & ASYNC_SYSCON_FRGCTRL_DIV_MASK) == 0U)
    {
        return 0U;
    }
    else
    {
        return CLOCK_GetAsyncApbClkFreq() /
               (1U + ((((ASYNC_SYSCON->FRGCTRL & ASYNC_SYSCON_FRGCTRL_MULT_MASK) >> 8U)) / 256U));
    }
}

uint32_t CLOCK_GetSpiClkFreq(void)
{
    if ((ASYNC_SYSCON->ASYNCCLKDIV & ASYNC_SYSCON_FRGCTRL_DIV_MASK) == 0U)
    {
        return 0U;
    }
    else
    {
        return CLOCK_GetAsyncApbClkFreq() /
               (1U + ((((ASYNC_SYSCON->FRGCTRL & ASYNC_SYSCON_FRGCTRL_MULT_MASK) >> 8U)) / 256U));
    }
}

uint32_t CLOCK_GetI2cClkFreq(void)
{
    if ((ASYNC_SYSCON->ASYNCCLKDIV & ASYNC_SYSCON_FRGCTRL_DIV_MASK) == 0U)
    {
        return 0U;
    }
    else
    {
        return CLOCK_GetAsyncApbClkFreq() /
               (1U + ((((ASYNC_SYSCON->FRGCTRL & ASYNC_SYSCON_FRGCTRL_MULT_MASK) >> 8U)) / 256U));
    }
}

